InformationRegisters/ГрафикиПриема.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ГрафикиПриема</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Прием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Поликлиника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поликлиники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Врачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кабинет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кабинеты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНаЛекарства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНаЛекарства</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Доступно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Лекарство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лекарства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аптека</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Аптеки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Прием.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Прием</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пациент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пациенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поликлиника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поликлиники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кабинет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кабинеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Врачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Рецепт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Рецепт</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Прием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПациентОповещенОСкидке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Лекарства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Лекарство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МеждународныеНепатентованыеНаименования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Льготное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/РаботаСРасписанием/Ext/Module.bsl
Функция ПолучитьДатыПриемаВрача(Поликлиника,Врач) Экспорт//+
	Результат=Новый ТаблицаЗначений;
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГрафикиПриема.Дата КАК Дата
		|ИЗ
		|	РегистрСведений.ГрафикиПриема КАК ГрафикиПриема
		|ГДЕ
		|	ГрафикиПриема.Поликлиника = &Поликлиника
		|	И ГрафикиПриема.Врач = &Врач
		|	И ГрафикиПриема.Дата >= &Дата
		|	И ГрафикиПриема.Прием = &ПустойПрием
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	Запрос.УстановитьПараметр("Врач", Врач);
	Запрос.УстановитьПараметр("Поликлиника", Поликлиника);
	Запрос.УстановитьПараметр("ПустойПрием", Документы.Прием.ПустаяСсылка());
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() тогда
		Результат=РезультатЗапроса.Выгрузить();	
	КонецЕсли;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	Возврат Результат;
КонецФункции

Функция ПолучитьВремяПриемаВрачаНаДату(Поликлиника,Врач,ДатаПриема) Экспорт//+
	
	Результат=Новый ТаблицаЗначений;
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГрафикиПриема.Время КАК Время
		|ИЗ
		|	РегистрСведений.ГрафикиПриема КАК ГрафикиПриема
		|ГДЕ
		|	ГрафикиПриема.Поликлиника = &Поликлиника
		|	И ГрафикиПриема.Врач = &Врач
		|	И ГрафикиПриема.Прием = &ПустойПрием
		|	И НАЧАЛОПЕРИОДА(ГрафикиПриема.Дата, ДЕНЬ) = &Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	Время";
	
	Запрос.УстановитьПараметр("Врач", Врач);
	Запрос.УстановитьПараметр("Поликлиника", Поликлиника);
	Запрос.УстановитьПараметр("ПустойПрием", Документы.Прием.ПустаяСсылка());
	Запрос.УстановитьПараметр("Дата", НачалоДня(ДатаПриема));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() тогда
		Результат=РезультатЗапроса.Выгрузить();	
	КонецЕсли;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	Возврат Результат;
КонецФункции

Функция ПолучитьПринимающихВрачейНаДату(Поликлиника,ДатаПриема) Экспорт//+
	Результат=Новый ТаблицаЗначений;
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГрафикиПриема.Врач КАК Врач
		|ИЗ
		|	РегистрСведений.ГрафикиПриема КАК ГрафикиПриема
		|ГДЕ
		|	ГрафикиПриема.Поликлиника = &Поликлиника
		|	И ГрафикиПриема.Прием = &ПустойПрием
		|	И НАЧАЛОПЕРИОДА(ГрафикиПриема.Дата, ДЕНЬ) = &Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	Врач";
	
	Запрос.УстановитьПараметр("Поликлиника", Поликлиника);
	Запрос.УстановитьПараметр("ПустойПрием", Документы.Прием.ПустаяСсылка());
	Запрос.УстановитьПараметр("Дата", НачалоДня(ДатаПриема));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() тогда
		Результат=РезультатЗапроса.Выгрузить();	
	КонецЕсли;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	Возврат Результат;
КонецФункции

Функция ПолучитьВрачейПоликлиники(Поликлиника) Экспорт//+
	Результат=Новый ТаблицаЗначений;
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ГрафикиПриема.Врач КАК Врач,
		|	ГрафикиПриема.Врач.Специализация.Представление КАК Специализация
		|ИЗ
		|	РегистрСведений.ГрафикиПриема КАК ГрафикиПриема
		|ГДЕ
		|	ГрафикиПриема.Поликлиника = &Поликлиника
		|	И ГрафикиПриема.Дата >= &Дата
		|	И ГрафикиПриема.Прием = &ПустойПрием";
	
	Запрос.УстановитьПараметр("Поликлиника", Поликлиника);
	Запрос.УстановитьПараметр("ПустойПрием", Документы.Прием.ПустаяСсылка());
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() тогда
		Результат=РезультатЗапроса.Выгрузить();	
	КонецЕсли;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	Возврат Результат;
КонецФункции

Функция ПолучитьВрачейПоСпециализации(Поликлиника,Специализация) Экспорт//+
	Результат=Новый ТаблицаЗначений;
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Врачи.Ссылка КАК Врач
		|ИЗ
		|	Справочник.Врачи КАК Врачи
		|ГДЕ
		|	Врачи.Специализация = &Специализация
		|
		|УПОРЯДОЧИТЬ ПО
		|	Врач";
	
	//Запрос.УстановитьПараметр("Поликлиника", Поликлиника);
	//Запрос.УстановитьПараметр("ПустойПрием", Документы.Прием.ПустаяСсылка());
	Запрос.УстановитьПараметр("Специализация", Специализация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() тогда
		Результат=РезультатЗапроса.Выгрузить();	
	КонецЕсли;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	Возврат Результат;
КонецФункции

Функция ПолучитьСписокПоследнихВрачейПоПациенту(Пациент) Экспорт//+
	Результат=Новый ТаблицаЗначений;
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	Прием.Врач КАК Врач,
	                    |	Прием.ДатаПриема КАК ДатаПриема
	                    |ИЗ
	                    |	Документ.Прием КАК Прием
	                    |ГДЕ
	                    |	Прием.Пациент = &Пациент
	                    |	И Прием.ДатаПриема < &Дата
	                    |
	                    |УПОРЯДОЧИТЬ ПО
	                    |	ДатаПриема УБЫВ");
	
	Запрос.УстановитьПараметр("Пациент",Пациент);
	Запрос.УстановитьПараметр("Дата",ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() тогда
		Результат=РезультатЗапроса.Выгрузить();	
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции

Функция ПолучитьРецептыПациента(Пациент) Экспорт//+
	Результат=Новый ТаблицаЗначений;
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	Рецепт.Ссылка КАК Рецепт
	                    |ИЗ
	                    |	Документ.Рецепт КАК Рецепт
	                    |ГДЕ
	                    |	Рецепт.Прием.Пациент = &Пациент
	                    |
	                    |УПОРЯДОЧИТЬ ПО
	                    |	Рецепт.Дата УБЫВ");
	Запрос.УстановитьПараметр("Пациент",Пациент);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() тогда
		Результат=РезультатЗапроса.Выгрузить();	
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции

Функция ПолучитьДанныеРецепта(Рецепт) Экспорт//+
	Результат=Новый ТаблицаЗначений;
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	РецептЛекарства.Лекарство КАК Лекарство,
	                    |	РецептЛекарства.Количество КАК Количество
	                    |ИЗ
	                    |	Документ.Рецепт.Лекарства КАК РецептЛекарства
	                    |ГДЕ
	                    |	РецептЛекарства.Ссылка = &Рецепт");
	Запрос.УстановитьПараметр("Рецепт",Рецепт);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() тогда
		Результат=РезультатЗапроса.Выгрузить();	
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции

Функция ОтправитьСМС(Телефон="89536543997",ТекстСообщения) Экспорт
	API_ID="50673DE6-CF1A-B2BF-FBEA-1ED01AB19D2C";
	АдресСервера="https://sms.ru";
	Попытка
		HTTPСоединение = Новый HTTPСоединение(АдресСервера);
		HTTPЗапрос = Новый HTTPЗапрос("https://sms.ru/sms/send?api_id="+API_ID+"&to="+
		Телефон+"&msg="+ТекстСообщения+"&json=0");
		HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);    
		ТекстОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
		
		Отправлено = ?(HTTPОтвет.КодСостояния = "200", Истина, Ложь);      
	Исключение
		Отправлено = Ложь;
	КонецПопытки;	
КонецФункции

Функция БлижайшаяДоступнаяДатаПриемаПосле(Дата,Врач) Экспорт
	Результат=Новый ТаблицаЗначений;
	
	Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                    |	ГрафикиПриема.Дата КАК Дата,
	                    |	ГрафикиПриема.Время КАК Время
	                    |ИЗ
	                    |	РегистрСведений.ГрафикиПриема КАК ГрафикиПриема
	                    |ГДЕ
	                    |	ГрафикиПриема.Врач = &Врач
	                    |	И ГрафикиПриема.Дата > &Дата
	                    |	И ГрафикиПриема.Прием = &ПустойПрием
	                    |
	                    |УПОРЯДОЧИТЬ ПО
	                    |	Дата,
	                    |	Время");
	Запрос.УстановитьПараметр("Дата",НачалоДня(Дата));
	Запрос.УстановитьПараметр("Врач",Врач);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() тогда
		Результат=РезультатЗапроса.Выгрузить();	
	КонецЕсли;
	
	Возврат Результат;		
КонецФункции

Функция БлижайшаяДоступнаяДатаПриемаПоСпециализации(Дата,Специализация) Экспорт
	Результат=Новый ТаблицаЗначений;
	
	Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                    |	ГрафикиПриема.Дата КАК Дата,
	                    |	ГрафикиПриема.Время КАК Время,
	                    |	ГрафикиПриема.Поликлиника КАК Поликлиника,
	                    |	ГрафикиПриема.Врач КАК Врач
	                    |ИЗ
	                    |	РегистрСведений.ГрафикиПриема КАК ГрафикиПриема
	                    |ГДЕ
	                    |	ГрафикиПриема.Врач.Специализация = &Специализация
	                    |	И ГрафикиПриема.Дата > &Дата
	                    |	И ГрафикиПриема.Прием = &ПустойПрием
	                    |
	                    |УПОРЯДОЧИТЬ ПО
	                    |	Дата,
	                    |	Время");
	
	Запрос.УстановитьПараметр("Дата",НачалоДня(Дата));
	Запрос.УстановитьПараметр("Специализация",Специализация);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() тогда
		Результат=РезультатЗапроса.Выгрузить();	
	КонецЕсли;
	
	Возврат Результат;		
КонецФункции

Функция ПолучитьЛучшиеЦеныПокупкиРецепта(Рецепт) Экспорт
	Результат=Новый ТаблицаЗначений;
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	РецептЛекарства.Лекарство КАК Лекарство,
	                    |	РецептЛекарства.Количество КАК Количество
	                    |ПОМЕСТИТЬ СписокЛекарств
	                    |ИЗ
	                    |	Документ.Рецепт.Лекарства КАК РецептЛекарства
	                    |ГДЕ
	                    |	РецептЛекарства.Ссылка = &Ссылка
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	ВложенныйЗапрос1.Аптека КАК Аптека
	                    |ПОМЕСТИТЬ АптекиСПолнымКомплектом
	                    |ИЗ
	                    |	(ВЫБРАТЬ
	                    |		ЦеныНаЛекарстваСрезПоследних.Аптека КАК Аптека,
	                    |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЦеныНаЛекарстваСрезПоследних.Лекарство) КАК КоличествоВАптеке,
	                    |		ВложенныйЗапрос.КоличествоПозицийВРецепте КАК КоличествоПозицийВРецепте
	                    |	ИЗ
	                    |		РегистрСведений.ЦеныНаЛекарства.СрезПоследних(
	                    |				,
	                    |				Лекарство.МеждународноеНепатентованноеНазвание В
	                    |					(ВЫБРАТЬ
	                    |						СписокЛекарств.Лекарство КАК Лекарство
	                    |					ИЗ
	                    |						СписокЛекарств КАК СписокЛекарств)) КАК ЦеныНаЛекарстваСрезПоследних
	                    |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                    |				СписокЛекарств.Лекарство КАК Лекарство,
	                    |				СписокЛекарств.Количество КАК Количество,
	                    |				КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СписокЛекарств.Лекарство) КАК КоличествоПозицийВРецепте
	                    |			ИЗ
	                    |				СписокЛекарств КАК СписокЛекарств
	                    |			
	                    |			СГРУППИРОВАТЬ ПО
	                    |				СписокЛекарств.Лекарство,
	                    |				СписокЛекарств.Количество) КАК ВложенныйЗапрос
	                    |			ПО ЦеныНаЛекарстваСрезПоследних.Лекарство.МеждународноеНепатентованноеНазвание = ВложенныйЗапрос.Лекарство
	                    |	ГДЕ
	                    |		ЦеныНаЛекарстваСрезПоследних.Доступно
	                    |	
	                    |	СГРУППИРОВАТЬ ПО
	                    |		ЦеныНаЛекарстваСрезПоследних.Аптека,
	                    |		ВложенныйЗапрос.КоличествоПозицийВРецепте) КАК ВложенныйЗапрос1
	                    |ГДЕ
	                    |	ВложенныйЗапрос1.КоличествоВАптеке = ВложенныйЗапрос1.КоличествоПозицийВРецепте
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	ЦеныНаЛекарстваСрезПоследних.Аптека КАК Аптека,
	                    |	ЦеныНаЛекарстваСрезПоследних.Лекарство КАК Лекарство,
	                    |	МИНИМУМ(ЦеныНаЛекарстваСрезПоследних.Цена) КАК Цена,
	                    |	СписокЛекарств.Количество КАК Количество
	                    |ПОМЕСТИТЬ МинимальныеЦеныВАптеках
	                    |ИЗ
	                    |	РегистрСведений.ЦеныНаЛекарства.СрезПоследних(
	                    |			,
	                    |			(Аптека, Лекарство.МеждународноеНепатентованноеНазвание) В
	                    |				(ВЫБРАТЬ
	                    |					АптекиСПолнымКомплектом.Аптека КАК Аптека,
	                    |					СписокЛекарств.Лекарство КАК Лекарство
	                    |				ИЗ
	                    |					АптекиСПолнымКомплектом КАК АптекиСПолнымКомплектом,
	                    |					СписокЛекарств КАК СписокЛекарств)) КАК ЦеныНаЛекарстваСрезПоследних
	                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АптекиСПолнымКомплектом КАК АптекиСПолнымКомплектом
	                    |		ПО ЦеныНаЛекарстваСрезПоследних.Аптека = АптекиСПолнымКомплектом.Аптека
	                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокЛекарств КАК СписокЛекарств
	                    |		ПО ЦеныНаЛекарстваСрезПоследних.Лекарство.МеждународноеНепатентованноеНазвание = СписокЛекарств.Лекарство
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ЦеныНаЛекарстваСрезПоследних.Аптека,
	                    |	ЦеныНаЛекарстваСрезПоследних.Лекарство,
	                    |	СписокЛекарств.Количество
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ ПЕРВЫЕ 10
	                    |	ВложенныйЗапрос.Аптека КАК Аптека,
	                    |	ВложенныйЗапрос.СтоимостьПакета КАК СтоимостьПакета
	                    |ИЗ
	                    |	(ВЫБРАТЬ
	                    |		МинимальныеЦеныВАптеках.Аптека КАК Аптека,
	                    |		СУММА(МинимальныеЦеныВАптеках.Цена * МинимальныеЦеныВАптеках.Количество) КАК СтоимостьПакета
	                    |	ИЗ
	                    |		МинимальныеЦеныВАптеках КАК МинимальныеЦеныВАптеках
	                    |	
	                    |	СГРУППИРОВАТЬ ПО
	                    |		МинимальныеЦеныВАптеках.Аптека) КАК ВложенныйЗапрос
	                    |
	                    |УПОРЯДОЧИТЬ ПО
	                    |	СтоимостьПакета");
	
	Запрос.УстановитьПараметр("Рецепт",Рецепт);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() тогда
		Результат=РезультатЗапроса.Выгрузить();	
	КонецЕсли;
	
	Возврат Результат;		
КонецФункции

Функция ПолучитьДоступностьЛьготныхПрепаратовПоРецепту(Рецепт) Экспорт
	Результат=Новый ТаблицаЗначений;
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ЦеныНаЛекарстваСрезПоследних.Аптека КАК Аптека,
	                    |	ЦеныНаЛекарстваСрезПоследних.Лекарство КАК Лекарство,
	                    |	ЦеныНаЛекарстваСрезПоследних.Цена КАК Цена
	                    |ИЗ
	                    |	Документ.Рецепт.Лекарства КАК РецептЛекарства
	                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНаЛекарства.СрезПоследних КАК ЦеныНаЛекарстваСрезПоследних
	                    |		ПО РецептЛекарства.Лекарство = ЦеныНаЛекарстваСрезПоследних.Лекарство.МеждународноеНепатентованноеНазвание
	                    |			И РецептЛекарства.Льготное = ЦеныНаЛекарстваСрезПоследних.Лекарство.Льготное
	                    |ГДЕ
	                    |	РецептЛекарства.Льготное
	                    |	И ЦеныНаЛекарстваСрезПоследних.Доступно
	                    |	И РецептЛекарства.Ссылка = &Рецепт");
	
	Запрос.УстановитьПараметр("Рецепт",Рецепт);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() тогда
		Результат=РезультатЗапроса.Выгрузить();	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ЭтоАРМ() Экспорт
	возврат РежимАРМ();	
КонецФункции

Функция РежимАРМ() Экспорт
	возврат РольДоступна("АРМ");	
КонецФункции
